app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    @posts = Post.all

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 3
---
  def update
    respond_to do |format|
      if @post.update(post_params)